/* DeSmuME Strings File */
/* CHINESE */

/* Dialog Box Titles */
"Open ROM" = "Open ROM";
"Open State File" = "Open State File";
"Save State File" = "Save State File";
"Import ROM Save File" = "Import ROM Save File";
"Export ROM Save File" = "Export ROM Save File";
"Select ROM" = "Select ROM";
"Select ADVANsCEne Database" = "Select ADVANsCEne Database";
"Select R4 Cheat Database" = "Select R4 Cheat Database";
"Select ARM7 BIOS Image" = "Select ARM7 BIOS Image";
"Select ARM9 BIOS Image" = "Select ARM9 BIOS Image";
"Select Firmware Image" = "Select Firmware Image";
"Save Screenshot" = "Save Screenshot";

/* Menus */
"Execute" = "执行";
"Pause" = "暂停";
"Disable Speed Limit" = "Disable Speed Limit";
"Enable Speed Limit" = "Enable Speed Limit";
"Disable Auto Frame Skip" = "Disable Auto Frame Skip";
"Enable Auto Frame Skip" = "Enable Auto Frame Skip";
"Disable Cheats" = "Disable Cheats";
"Enable Cheats" = "Enable Cheats";
"Disable HUD" = "Disable HUD";
"Enable HUD" = "Enable HUD";
"Hide Status Bar" = "Hide Status Bar";
"Show Status Bar" = "显示状态栏";
"Speed 1x" = "Speed 1x";
"Speed 2x" = "Speed 2x";
"Slot %d" = "存储点 %d";

/* Alert Text */
"A critical file is missing. DeSmuME will now quit." = "A critical file is missing. DeSmuME will now quit.";
"The file \"DefaultUserPrefs.plist\" is missing. Please reinstall DeSmuME." = "The file \"DefaultUserPrefs.plist\" is missing. Please reinstall DeSmuME.";

/* Status Text */
"Ready." = "Ready.";

"Save state file loading failed!" = "Save state file loading failed!";
"Save state file loaded." = "Save state file loaded.";
"Save state file saving failed!" = "Save state file saving failed!";
"Save state file saved." = "Save state file saved.";
"Save state file reverting failed!" = "Save state file reverting failed!";
"Save state file reverted." = "Save state file reverted.";

"ROM save file import failed!" = "ROM save file import failed!";
"ROM save file imported." = "ROM save file imported.";
"ROM save file export failed!" = "ROM save file export failed!";
"ROM save file exported." = "ROM save file exported.";

"Loading ROM..." = "Loading ROM...";
"ROM loaded." = "ROM loaded.";
"ROM loading failed!" = "ROM loading failed!";
"Unloading ROM..." = "Unloading ROM...";
"ROM unloaded." = "ROM unloaded.";

"Emulator resetting..." = "Emulator resetting...";
"Emulator reset." = "Emulator reset.";

"Cannot generate the save file path!" = "Cannot generate the save file path!";
"Cannot create the save directory!" = "Cannot create the save directory!";

"Speed limit disabled." = "Speed limit disabled.";
"Speed limit enabled." = "Speed limit enabled.";
"Auto frame skip disabled." = "Auto frame skip disabled.";
"Auto frame skip enabled." = "Auto frame skip enabled.";
"Cheats disabled." = "Cheats disabled.";
"Cheats enabled." = "Cheats enabled.";
"HUD disabled." = "HUD disabled.";
"HUD enabled." = "HUD enabled.";

"Volume: %1.1f%%" = "Volume: %1.1f%%";

/* ROM Info Panel */
"No ROM loaded." = "No ROM loaded.";
"%i bytes" = "%i bytes";

/* Display Mode Strings */
"Main" = "Main";
"Touch" = "Touch";
"Combo" = "Combo";


/* LEGACY STRINGS */

/* General */
"DeSmuME Emulator" = "DeSmuME 模拟器";
"OK" = "确认";
"Cancel" = "取消";

/* File Menu */
//"Slot %d" = "存储点 %d";

/* Emulation Menu */
//"Execute" = "执行";
//"Pause" = "暂停";

/* View Menu */
//"Show Status Bar" = "显示状态栏";
"Hide Status Bar" = "Hide Status Bar";

/* Dialogs */
"Are you sure you want to quit?" = "你确定想要退出?";
"Are you sure you want to close the ROM?" = "你确定想要关闭这个ROM?";

/* Status Bar Messages */
"No ROM Loaded" = "没有ROM被载入";
"Executing" = "执行中";
"Paused" = "已暂停";

/* Preferences Window */
"DeSmuME Preferences" = "DeSmuME 偏好设定";
"Interface" = "界面";
"Controls" = "控制";
"DS Firmware" = "DS 固件";
"Yes" = "是";
"No" = "否";

/* Interface Preferences */
"Execute Upon Load" = "装载后执行";
"When Launching, Load" = "启动时载入";
"Load Nothing" = "不载入";
"Load Last ROM" = "上次使用的ROM";

/* Control Preferences */
"A Button" = "A";
"B Button" = "B";
"X Button" = "X";
"Y Button" = "Y";
"L Button" = "L";
"R Button" = "R";
"Up Button" = "Up";
"Down Button" = "Down";
"Left Button" = "Left";
"Right Button" = "Right";
"Start Button" = "Start";
"Select Button" = "Select";
"Up Key" = "[UP]";
"Down Key" = "[DOWN]";
"Left Key" = "[LEFT]";
"Right Key" = "[RIGHT]";
"Space Bar" = "[SPACE]";
"Enter Key" = "[ENTER]";

/* Status Bar */
"No ROM loaded" = "没有 ROM 被装载";
"ROM Loaded" = "ROM 被装载";
"Emulation Executing" = "执行中";
"Emulation Paused" = "已暂停";
"Emulation Reset" = "重启";

/* Errors */
"Error" = "错误";
"An emulation error occurred" = "模拟器发生了一个错误";
